app/controllers/base_controller.rb

  def site_index
    @posts = Post.find_recent(:limit => 20)
---
SELECT * FROM `posts` WHERE ((posts.published_at > '2009-01-28 23:03:43') AND (published_as = 'live')) ORDER BY posts.view_count DESC LIMIT 10

  def find_user
    if @user = User.active.find(params[:user_id] || params[:id])
---
SELECT * FROM `users` WHERE (users.featured_writer = 1)