app/controllers/users_controller.rb

SELECT * FROM `users` WHERE (`users`.`activation_code` = 'bad_activation_code') LIMIT 1
---
  def activate
    @user = User.find_by_activation_code(params[:id])

INSERT INTO `users` (`salt`, `last_login_at`, `updated_at`, `activated_at`, `zip`, `crypted_password`, `stylesheet`, `remember_token_expires_at`, `activation_code`, `country_id`, `role_id`, `avatar_id`, `login_slug`, `gender`, `description`, `remember_token`, `metro_area_id`, `birthday`, `activities_count`, `vendor`, `notify_friend_requests`, `featured_writer`, `sb_posts_count`, `sb_last_seen_at`, `login`, `state_id`, `notify_community_news`, `profile_public`, `email`, `created_at`, `view_count`, `notify_comments`) VALUES('a7224589651ff3c6a3c88d309e2f3f3617a8a4b4', NULL, '2009-02-04 23:08:54', NULL, NULL, '68766ca85a477184e437fa2a874b460675700f23', NULL, NULL, '9c9113b45edfd4ba81a3c62caae6f2271279793b', NULL, 3, NULL, 'quire', NULL, NULL, NULL, NULL, '1994-02-04', 0, 0, 1, 0, 0, NULL, 'quire', NULL, 1, 1, 'quire@example.com', '2009-02-04 23:08:54', 0, 1)
---
  def create
    puts "inviter_id: #{params[:inviter_id]}\ninviter_code: #{params[:inviter_code]}"
    @user       = User.new(params[:user])
    @user.role  = Role[:member]

    if @user.save

SELECT * FROM `metro_areas` WHERE (`metro_areas`.state_id = 1) ORDER BY name
SELECT * FROM `users` WHERE (`users`.`id` = 1) AND (users.activated_at IS NOT NULL)
SELECT count(*) AS count_all FROM `users` WHERE (metro_area_id = 1)
INSERT INTO `photos` (`name`, `content_type`, `updated_at`, `size`, `thumbnail`, `description`, `filename`, `height`, `user_id`, `parent_id`, `created_at`, `width`) VALUES(NULL, 'image/jpg', '2009-02-04 23:09:18', 16966, NULL, NULL, 'library.jpg', NULL, 1, NULL, '2009-02-04 23:09:18', NULL)
UPDATE `metro_areas` SET `users_count` = 1 WHERE `id` = 1
UPDATE `users` SET `login` = 'changed_login', `login_slug` = 'changed-login', `state_id` = NULL, `metro_area_id` = NULL, `email` = 'changed_email@email.com', `updated_at` = '2009-02-04 23:09:35' WHERE `id` = 1
---
  def update
    @user.attributes      = params[:user]
    @metro_areas, @states = setup_locations_for(@user)

    unless params[:metro_area_id].blank?
      @user.metro_area  = MetroArea.find(params[:metro_area_id])
      @user.state       = (@user.metro_area && @user.metro_area.state) ? @user.metro_area.state : nil
      @user.country     = @user.metro_area.country if (@user.metro_area && @user.metro_area.country)
    else
      @user.metro_area = @user.state = @user.country = nil
    end

    @avatar       = Photo.new(params[:avatar])
    @avatar.user  = @user

    @user.avatar  = @avatar if @avatar.save

DELETE FROM `users` WHERE `id` = 1
---
  def destroy
    unless @user.admin? || @user.featured_writer?
      @user.destroy

UPDATE `users` SET `login` = 'changed_login', `login_slug` = 'changed-login', `updated_at` = '2009-02-04 23:09:34' WHERE `id` = 1
---
  def update_account
    @user             = current_user
    @user.attributes  = params[:user]

    if @user.save!

SELECT * FROM `users` WHERE (`users`.`activation_code` IS NULL) LIMIT 1
---
  def signup_completed
    @user = User.find_by_activation_code(params[:id])

SELECT * FROM `users` WHERE (`users`.`id` = 1) LIMIT 1
---
  def welcome_photo
    @user = User.find(params[:id])

SELECT * FROM `users` WHERE (`users`.`id` = 1) LIMIT 1
---
  def welcome_about
    @user = User.find(params[:id])

SELECT * FROM `users` WHERE (`users`.`id` = 1) LIMIT 1
---
  def welcome_invite
    @user = User.find(params[:id])

SELECT `users`.id FROM `users` WHERE (LOWER(`users`.`email`) = BINARY 'quentin@example.com' AND `users`.id <> 1) LIMIT 1
UPDATE `users` SET `crypted_password` = '06bcb02bb27861ea565b1e04e163d79ec7cc0017', `updated_at` = '2009-02-04 23:09:28' WHERE `id` = 1
---
  def forgot_password
    return unless request.post?

    @user = User.find_by_email(params[:email])
    if @user && @user.reset_password
      UserNotifier.deliver_reset_password(@user)
      @user.save

SELECT * FROM `users` WHERE (`users`.`email` = 'quentin@example.com') LIMIT 1
---
  def forgot_username
    return unless request.post?

    if @user = User.find_by_email(params[:email])

SELECT * FROM `users` WHERE (`users`.`email` = 'quentin@example.com') LIMIT 1
---
  def resend_activation
    return unless request.post?

    @user = User.find_by_email(params[:email])

SELECT * FROM `users` WHERE (`users`.`id` = 4) LIMIT 1
---
  def assume
    self.current_user = User.find(params[:id])

SELECT * FROM `users` WHERE (`users`.`id` = 1) LIMIT 1
---
  def return_admin
    unless session[:admin_id].nil? or current_user.admin?
      admin = User.find(session[:admin_id])

SELECT * FROM `users` WHERE (`users`.`id` = 1) LIMIT 1
UPDATE `users` SET `featured_writer` = 1, `updated_at` = '2009-02-04 23:09:32' WHERE `id` = 1
---
  def toggle_featured
    @user = User.find(params[:id])
    @user.toggle!(:featured_writer)

SELECT * FROM `users` WHERE (`users`.`id` = 4) LIMIT 1
UPDATE `users` SET `role_id` = 2, `updated_at` = '2009-02-04 23:09:33' WHERE `id` = 1
---
  def toggle_moderator
    @user = User.find(params[:id])
    @user.role = @user.moderator? ? Role[:member] : Role[:moderator]
    @user.save!

SELECT * FROM `posts` WHERE (`posts`.user_id = 8 AND ('2009-02-01 00:00:00' <= published_at AND published_at <= '2009-03-01 23:59:59')) AND (published_as = 'live') ORDER BY published_at desc
---
  def statistics
    if params[:date]
      date = Date.new(params[:date][:year].to_i, params[:date][:month].to_i)
      @month = Time.parse(date.to_s)
    else
      @month = Time.today
    end

    start_date  = @month.beginning_of_month
    end_date    = @month.end_of_month + 1.day

    @posts = @user.posts.find(:all,
      :conditions => ['? <= published_at AND published_at <= ?', start_date, end_date])